<!-- terraform-plan-repository -->
### Terraform Plan: `repository` ✅

<details>
<summary>Show plan output</summary>

```
data.github_user.reviewer: Reading...
data.github_user.reviewer: Read complete after 0s [id=51869472]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_issue_label.infrastructure will be created
  + resource "github_issue_label" "infrastructure" {
      + color       = "0e8a16"
      + description = "Infrastructure and Terraform changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "infrastructure"
      + repository  = "reinhardt"
      + url         = (known after apply)
    }

  # github_repository_environment.fork_review will be created
  + resource "github_repository_environment" "fork_review" {
      + can_admins_bypass   = true
      + environment         = "fork-review"
      + id                  = (known after apply)
      + prevent_self_review = true
      + repository          = "reinhardt"
      + wait_timer          = 0

      + reviewers {
          + users = [
              + 51869472,
            ]
        }
    }

  # github_repository_environment.production will be created
  + resource "github_repository_environment" "production" {
      + can_admins_bypass   = true
      + environment         = "production"
      + id                  = (known after apply)
      + prevent_self_review = true
      + repository          = "reinhardt"
      + wait_timer          = 0

      + reviewers {
          + users = [
              + 51869472,
            ]
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + fork_review_environment = "fork-review"
  + production_environment  = "production"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>